Tekla Open API Reference for Tekla Structures 2025
Operation.Combine Method (SingleRebar, SingleRebar)
 Combines two single rebars into one rebar.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static SingleRebar Combine(
	SingleRebar ObjectToCombineTo,
	SingleRebar ObjectToBeCombined
)
Public Shared Function Combine (
	ObjectToCombineTo As SingleRebar,
	ObjectToBeCombined As SingleRebar
) As SingleRebar
Parameters
ObjectToCombineTo
Type: Tekla.Structures.Model.SingleRebar
The rebar to be combined to.
ObjectToBeCombined
Type: Tekla.Structures.Model.SingleRebar
The rebar which will be deleted after a successful operation.
Return Value
Type: SingleRebar
The combined single rebar on success, null on failure.
See Also
Reference
Operation Class
Combine Overload
Tekla.Structures.Model.Operations Namespace